# Title Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Asset..::..Title Property
Asset Class See Also
---
Asset title
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Title { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Title As String
	Get
```

Visual C++
---
```text
public:
property String^ Title {
	String^ get ();
}
```

# See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace